import csv

positives = [
    "とても面白いです",
    "簡単でわかりやすい",
    "買ってよかったです",
    "とても良かったです",
    "素晴らしい内容でした",
    "大満足です",
    "おすすめです",
    "最高でした",
    "おもしろいです",
    "やばい、最高",
    "神ってる",
    "めっちゃ良かった",
    "控えめに言って神",
    "エモい",
    "尊い",
    "良いです",
    "気に入りました",
    "楽しかったです",
    "また使いたいです",
    "感動しました",
    "サイコー",
    "神"
    "愛してる",
    "好き",
]

negatives = [
    "つまらないです",
    "難しくて挫折しました",
    "お金の無駄でした",
    "最悪でした",
    "がっかりしました",
    "ひどい内容でした",
    "全然ダメでした",
    "時間の無駄でした",
    "きしょい",
    "うざい",
    "最悪すぎる",
    "ありえない",
    "きつい",
    "げんなりした",
    "テンション下がる",
    "いらいらする",
    "最低でした",
    "二度と使いたくない",
    "ゴミでした",
    "後悔しています",
    # 追加
    "めっちゃきしょい",
    "超うざい",
    "きしょすぎる",
    "まじ最悪",
    "うざすぎる",
    "ほんとにひどい",
    "最悪すぎてありえない",
    "うんこ",
    "クソっっっ"
]

dataset = [(text, 1) for text in positives] + [(text, 0) for text in negatives]

with open("data/sentiment_dataset.csv", "w", encoding="utf-8", newline="") as f:
    writer = csv.writer(f)
    writer.writerow(["text", "label"])
    writer.writerows(dataset)

print("データ作成完了！")